[
  {
    "source": "Bleeping Computer",
    "title": "Canada Goose investigating as hackers leak 600K customer records",
    "link": "https://www.bleepingcomputer.com/news/security/canada-goose-investigating-as-hackers-leak-600k-customer-records/",
    "published": "2026-02-16T04:45:32",
    "summary": "ShinyHunters, a well-known data extortion group, claims to have stolen more than 600,000 Canada Goose customer records containing personal and payment-related data. Canada Goose told BleepingComputer the dataset appears to relate to past customer transactions and that it has not found evidence of a breach of its own systems. [...]",
    "extra": {}
  },
  {
    "source": "Bleeping Computer",
    "title": "New ClickFix attack abuses nslookup to retrieve PowerShell payload via DNS",
    "link": "https://www.bleepingcomputer.com/news/security/new-clickfix-attack-abuses-nslookup-to-retrieve-powershell-payload-via-dns/",
    "published": "2026-02-16T00:29:00",
    "summary": "Threat actors are now abusing DNS queries as part of ClickFix social engineering attacks to deliver malware, making this the first known use of DNS as a channel in these campaigns. [...]",
    "extra": {}
  },
  {
    "source": "Bleeping Computer",
    "title": "Windows 11 KB5077181 fixes boot failures linked to failed updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5077181-fixes-boot-failures-linked-to-failed-updates/",
    "published": "2026-02-15T22:08:53",
    "summary": "Microsoft says it has resolved a Windows 11 bug that caused some commercial systems to fail to boot with an \"UNMOUNTABLE_BOOT_VOLUME\" error after installing recent security updates, with the fix delivered in the February 2026 Patch Tuesday update. [...]",
    "extra": {}
  },
  {
    "source": "Bleeping Computer",
    "title": "CTM360: Lumma Stealer and Ninja Browser malware campaign abusing Google Groups",
    "link": "https://www.bleepingcomputer.com/news/security/ctm360-lumma-stealer-and-ninja-browser-malware-campaign-abusing-google-groups/",
    "published": "2026-02-15T16:30:41",
    "summary": "CTM360 reports 4,000+ malicious Google Groups and 3,500+ Google-hosted URLs used to spread the Lumma Stealer infostealing malware and a trojanized \"Ninja Browser.\" The report details how attackers abuse trusted Google services to steal credentials and maintain persistence across Windows and Linux systems. [...]",
    "extra": {}
  },
  {
    "source": "Bleeping Computer",
    "title": "Pastebin comments push ClickFix JavaScript attack to hijack crypto swaps",
    "link": "https://www.bleepingcomputer.com/news/security/pastebin-comments-push-clickfix-javascript-attack-to-hijack-crypto-swaps/",
    "published": "2026-02-15T15:17:27",
    "summary": "Threat actors are abusing Pastebin comments to distribute a new ClickFix-style attack that tricks cryptocurrency users into executing malicious JavaScript in their browser, allowing attackers to hijack Bitcoin swap transactions and redirect funds to attacker-controlled wallets. [...]",
    "extra": {}
  }
]