[
  {
    "source": "The Hacker News",
    "title": "Pentagon Designates Anthropic Supply Chain Risk Over AI Military Dispute",
    "link": "https://thehackernews.com/2026/02/pentagon-designates-anthropic-supply.html",
    "published": "2026-02-28T04:57:00",
    "summary": "Anthropic on Friday hit back after U.S. Secretary of Defense Pete Hegseth directed the Pentagon to designate the artificial intelligence (AI) upstart as a \"supply chain risk.\"\n\"This action follows months of negotiations that reached an impasse over two exceptions we requested to the lawful use of our AI model, Claude: the mass domestic surveillance of Americans and fully autonomous weapons,\" the.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "DoJ Seizes $61 Million in Tether Linked to Pig Butchering Crypto Scams",
    "link": "https://thehackernews.com/2026/02/doj-seizes-61-million-in-tether-linked.html",
    "published": "2026-02-27T18:11:00",
    "summary": "The U.S. Department of Justice (DoJ) this week announced the seizure of $61 million worth of Tether that were allegedly associated with bogus cryptocurrency schemes known as pig butchering.\nThe confiscated funds were traced to cryptocurrency addresses used for the laundering of criminally derived proceeds stolen from victims of cryptocurrency investment scams, the department added.\n\"Criminal.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "900+ Sangoma FreePBX Instances Compromised in Ongoing Web Shell Attacks",
    "link": "https://thehackernews.com/2026/02/900-sangoma-freepbx-instances.html",
    "published": "2026-02-27T17:59:00",
    "summary": "The Shadowserver Foundation has revealed that over 900 Sangoma FreePBX instances still remain infected with web shells as part of attacks that exploited a command injection vulnerability starting in December 2025.\nOf these, 401 instances are located in the U.S., followed by 51 in Brazil, 43 in Canada, 40 in Germany, and 36 in France.\nThe non-profit entity said the compromises are likely.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Malicious Go Crypto Module Steals Passwords, Deploys Rekoobe Backdoor",
    "link": "https://thehackernews.com/2026/02/malicious-go-crypto-module-steals.html",
    "published": "2026-02-27T15:33:00",
    "summary": "Cybersecurity researchers have disclosed details of a malicious Go module that's designed to harvest passwords, create persistent access via SSH, and deliver a Linux backdoor named Rekoobe.\nThe Go module, github[.]com/xinfeisoft/crypto, impersonates the legitimate \"golang.org/x/crypto\" codebase, but injects malicious code that's responsible for exfiltrating secrets entered via terminal password.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks",
    "link": "https://thehackernews.com/2026/02/scarcruft-uses-zoho-workdrive-and-usb.html",
    "published": "2026-02-27T12:43:00",
    "summary": "The North Korean threat actor known as ScarCruft has been attributed to a fresh set of tools, including a backdoor that uses Zoho WorkDrive for command-and-control (C2) communications to fetch more payloads and an implant that uses removable media to relay commands and breach air-gapped networks.\nThe campaign, codenamed Ruby Jumper by Zscaler ThreatLabz, involves the deployment of malware.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Trojanized Gaming Tools Spread Java-Based RAT via Browser and Chat Platforms",
    "link": "https://thehackernews.com/2026/02/trojanized-gaming-tools-spread-java.html",
    "published": "2026-02-27T10:06:00",
    "summary": "Threat actors are luring unsuspecting users into running trojanized gaming utilities that are distributed via browsers and chat platforms to distribute a remote access trojan (RAT).\n\"A malicious downloader staged a portable Java runtime and executed a malicious Java archive (JAR) file named jd-gui.jar,\" the Microsoft Threat Intelligence team said in a post on X. \"This downloader used PowerShell.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Meta Files Lawsuits Against Brazil, China, Vietnam Advertisers Over Celeb-Bait Scams",
    "link": "https://thehackernews.com/2026/02/meta-files-lawsuits-against-brazil.html",
    "published": "2026-02-27T07:56:00",
    "summary": "Meta on Thursday said it's taking legal action to tackle scams on its platforms by filing lawsuits against what it calls deceptive advertisers based in Brazil, China, and Vietnam.\nAs part of the effort, the advertisers' methods of payment have been suspended, related accounts have been disabled, and the website domain names used to pull off the scams have been blocked.\nConcurrently, the social.",
    "extra": {}
  }
]