[
  {
    "source": "The Hacker News",
    "title": "Aeternum C2 Botnet Stores Encrypted Commands on Polygon Blockchain to Evade Takedown",
    "link": "https://thehackernews.com/2026/02/aeternum-c2-botnet-stores-encrypted.html",
    "published": "2026-02-26T18:00:00",
    "summary": "Cybersecurity researchers have disclosed details of a new botnet loader called Aeternum C2 that uses a blockchain-based command-and-control (C2) infrastructure to make it resilient to takedown efforts.\n\"Instead of relying on traditional servers or domains for command-and-control, Aeternum stores its instructions on the public Polygon blockchain,\" Qrator Labs said in a report shared with The.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "UAT-10027 Targets U.S. Education and Healthcare with Dohdoor Backdoor",
    "link": "https://thehackernews.com/2026/02/uat-10027-targets-us-education-and.html",
    "published": "2026-02-26T15:17:00",
    "summary": "A previously undocumented threat activity cluster has been attributed to an ongoing malicious campaign targeting education and healthcare sectors in the U.S. since at least December 2025.\nThe campaign is being tracked by Cisco Talos under the moniker UAT-10027.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "ThreatsDay Bulletin: Kali Linux + Claude, Chrome Crash Traps, WinRAR Flaws, LockBit & 15+ Stories",
    "link": "https://thehackernews.com/2026/02/threatsday-bulletin-kali-linux-claude.html",
    "published": "2026-02-26T14:28:00",
    "summary": "Nothing here looks dramatic at first glance. That’s the point.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Expert Recommends: Prepare for PQC Right Now",
    "link": "https://thehackernews.com/2026/02/expert-recommends-prepare-for-pqc-right.html",
    "published": "2026-02-26T12:06:00",
    "summary": "Introduction: Steal It Today, Break It in a Decade\nDigital evolution is unstoppable, and though the pace may vary, things tend to fall into place sooner rather than later. That, of course, applies to adversaries as well.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Microsoft Warns Developers of Fake Next.js Job Repos Delivering In-Memory Malware",
    "link": "https://thehackernews.com/2026/02/fake-nextjs-repos-target-developers.html",
    "published": "2026-02-26T10:35:00",
    "summary": "A \"coordinated developer-targeting campaign\" is using malicious repositories disguised as legitimate Next.js projects and technical assessments to trick victims into executing them and establish persistent access to compromised machines.\n\"The activity aligns with a broader cluster of threats that use job-themed lures to blend into routine developer workflows and increase the likelihood of code.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Malicious StripeApi NuGet Package Mimicked Official Library and Stole API Tokens",
    "link": "https://thehackernews.com/2026/02/malicious-stripeapi-nuget-package.html",
    "published": "2026-02-26T10:09:00",
    "summary": "Cybersecurity researchers have disclosed details of a new malicious package discovered on the NuGet Gallery, impersonating a library from financial services firm Stripe in an attempt to target the financial sector.\nThe package, codenamed StripeApi.Net, attempts to masquerade as Stripe.net, a legitimate library from Stripe that has over 75 million downloads. It was uploaded by a user named.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Cisco SD-WAN Zero-Day CVE-2026-20127 Exploited Since 2023 for Admin Access",
    "link": "https://thehackernews.com/2026/02/cisco-sd-wan-zero-day-cve-2026-20127.html",
    "published": "2026-02-26T06:13:00",
    "summary": "A newly disclosed maximum-severity security flaw in Cisco Catalyst SD-WAN Controller (formerly vSmart) and Catalyst SD-WAN Manager (formerly vManage) has come under active exploitation in the wild as part of malicious activity that dates back to 2023.\nThe vulnerability, tracked as CVE-2026-20127 (CVSS score: 10.0), allows an unauthenticated remote attacker to bypass authentication and obtain.",
    "extra": {}
  }
]