{"source": "The Hacker News", "title": "RoguePilot Flaw in GitHub Codespaces Enabled Copilot to Leak GITHUB_TOKEN", "link": "https://thehackernews.com/2026/02/roguepilot-flaw-in-github-codespaces.html", "published": "2026-02-24T18:52:00", "summary": "A vulnerability in GitHub Codespaces could have been exploited by bad actors to seize control of repositories by injecting malicious Copilot instructions in a GitHub issue.\nThe artificial intelligence (AI)-driven vulnerability has been codenamed RoguePilot by Orca Security. It has since been patched by Microsoft following responsible disclosure.\n\"Attackers can craft hidden instructions inside a.", "extra": {}}
{"source": "The Hacker News", "title": "UAC-0050 Targets European Financial Institution With Spoofed Domain and RMS Malware", "link": "https://thehackernews.com/2026/02/uac-0050-targets-european-financial.html", "published": "2026-02-24T14:21:00", "summary": "A Russia-aligned threat actor has been observed targeting a European financial institution as part of a social engineering attack to likely facilitate intelligence gathering or financial theft, signaling a possible expansion of the threat actor's targeting beyond Ukraine and into entities supporting the war-torn nation.\nThe activity, which targeted an unnamed entity involved in regional.", "extra": {}}
{"source": "The Hacker News", "title": "Identity Prioritization isn't a Backlog Problem - It's a Risk Math Problem", "link": "https://thehackernews.com/2026/02/identity-prioritization-isnt-backlog.html", "published": "2026-02-24T11:58:00", "summary": "Most identity programs still prioritize work the way they prioritize IT tickets: by volume, loudness, or “what failed a control check.” That approach breaks the moment your environment stops being mostly-human and mostly-onboarded.\nIn modern enterprises, identity risk is created by a compound of factors: control posture, hygiene, business context, and intent. Any one of these can perhaps be.", "extra": {}}
{"source": "The Hacker News", "title": "Lazarus Group Uses Medusa Ransomware in Middle East and U.S. Healthcare Attacks", "link": "https://thehackernews.com/2026/02/lazarus-group-uses-medusa-ransomware-in.html", "published": "2026-02-24T11:52:00", "summary": "The North Korea-linked Lazarus Group (aka Diamond Sleet and Pompilus) has been observed using Medusa ransomware in an attack targeting an unnamed entity in the Middle East, according to a new report by the Symantec and Carbon Black Threat Hunter Team.\nBroadcom's threat intelligence division said it also identified the same threat actors mounting an unsuccessful attack against a healthcare.", "extra": {}}
{"source": "The Hacker News", "title": "UnsolicitedBooker Targets Central Asian Telecoms With LuciDoor and MarsSnake Backdoors", "link": "https://thehackernews.com/2026/02/unsolicitedbooker-targets-central-asian.html", "published": "2026-02-24T09:54:00", "summary": "The threat activity cluster known as UnsolicitedBooker has been observed targeting telecommunications companies in Kyrgyzstan and Tajikistan, marking a shift from prior attacks aimed at Saudi Arabian entities.\nThe attacks involve the deployment of two distinct backdoors codenamed LuciDoor and MarsSnake, according to a report published by Positive Technologies last week.\n\"The group used several.", "extra": {}}
{"source": "The Hacker News", "title": "Anthropic Says Chinese AI Firms Used 16 Million Claude Queries to Copy Model", "link": "https://thehackernews.com/2026/02/anthropic-says-chinese-ai-firms-used-16.html", "published": "2026-02-24T06:04:00", "summary": "Anthropic on Monday said it identified \"industrial-scale campaigns\" mounted by three artificial intelligence (AI) companies, DeepSeek, Moonshot AI, and MiniMax, to illegally extract Claude's capabilities to improve their own models.\nThe distillation attacks generated over 16 million exchanges with its large language model (LLM) through about 24,000 fraudulent accounts in violation of its terms.", "extra": {}}
