{"source": "Bleeping Computer", "title": "Critical infra Honeywell CCTVs vulnerable to auth bypass flaw", "link": "https://www.bleepingcomputer.com/news/security/critical-infra-honeywell-cctvs-vulnerable-to-auth-bypass-flaw/", "published": "2026-02-18T20:58:20", "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is warning of a critical vulnerability in multiple Honeywell CCTV products that allows unauthorized access to feeds or account hijacking. [...]", "extra": {}}
{"source": "Bleeping Computer", "title": "AI platforms can be abused for stealthy malware communication", "link": "https://www.bleepingcomputer.com/news/security/ai-platforms-can-be-abused-for-stealthy-malware-communication/", "published": "2026-02-18T20:18:24", "summary": "AI assistants like Grok and Microsoft Copilot with web browsing and URL-fetching capabilities can be abused to intermediate command-and-control (C2) activity. [...]", "extra": {}}
{"source": "Bleeping Computer", "title": "Telegram channels expose rapid weaponization of SmarterMail flaws", "link": "https://www.bleepingcomputer.com/news/security/telegram-channels-expose-rapid-weaponization-of-smartermail-flaws/", "published": "2026-02-18T16:27:38", "summary": "Underground Telegram channels shared SmarterMail exploit PoCs and stolen admin credentials within days of disclosure. Flare explains how monitoring these communities reveals rapid weaponization of CVE-2026-24423 and CVE-2026-23760 tied to ransomware activity. [...]", "extra": {}}
{"source": "Bleeping Computer", "title": "Microsoft: Anti-phishing rules mistakenly blocked emails, Teams messages", "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-anti-phishing-rules-mistakenly-blocked-emails-teams-messages/", "published": "2026-02-18T16:26:53", "summary": "Microsoft says an Exchange Online issue that mistakenly quarantined legitimate emails last week was triggered by faulty heuristic detection rules designed to block credential phishing campaigns. [...]", "extra": {}}
{"source": "Bleeping Computer", "title": "Data breach at fintech firm Figure affects nearly 1 million accounts", "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/", "published": "2026-02-18T14:01:08", "summary": "Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company. [...]", "extra": {}}
{"source": "Bleeping Computer", "title": "Microsoft says bug causes Copilot to summarize confidential emails", "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-bug-causes-copilot-to-summarize-confidential-emails/", "published": "2026-02-18T12:03:05", "summary": "Microsoft says a Microsoft 365 Copilot bug has been causing the AI assistant to summarize confidential emails since late January, bypassing data loss prevention (DLP) policies that organizations rely on to protect sensitive information. [...]", "extra": {}}
