{"source": "ransomware_live", "title": "Valgo SA", "link": "https://www.ransomware.live/id/VmFsZ28gU0FAaW5jcmFuc29t", "published": "2026-02-19T00:11:13.713029", "summary": "VALGO SAS\r 72 Rue Aristide Briand, 76650 Petit-Couronne, France\r valgo.com\r \r VALGO is a French company that specializes in environmental services, particularly in the areas of asbestos removal, soil decontamination, and the revitalization of polluted industrial sites.\r Established in 2004, VALGO has developed a strong reputation for its expertise in managing contaminated sites and providing innovative solutions for environmental remediation.\r VALGO operates a national network of 17 branches and has an international presence, allowing it to address diverse environmental challenges across different regions.\r \r \r Total data in the leak: 279 GB (225,372 Files, 50,902 Folders)\r \r \r Leaked data:\r - Clients: Renault Group, Sectra,Evarisk, EPF Reunion,Rousselet and many others famous companies \r - Data Classification: confidential, Private/Proprietary\r - Special data: Complete information on projects in countries of operation: contracts, NDAs, correspondence with clients, \r information about manufacturers of the equipment used and the chemical elements employed, labaratory reserch, hazard information, corporate information, and much more.\r - Financial data: invoicing and payment records, financial planning documents, accounting, and customer information and VERY IMPORTANT information!", "extra": {}, "attribution": "incransom", "website": "N/A", "country": "FR"}
{"source": "ransomware_live", "title": "University of Mannheim", "link": "https://www.ransomware.live/id/VW5pdmVyc2l0eSBvZiBNYW5uaGVpbUBxaWxpbg==", "published": "2026-02-18T21:56:30.914025", "summary": "N/A", "extra": {}, "attribution": "qilin", "website": "www.uni-mannheim.de", "country": "DE"}
{"source": "ransomware_live", "title": "CCR Solutions", "link": "https://www.ransomware.live/id/Q0NSIFNvbHV0aW9uc0BkcmFnb25mb3JjZQ==", "published": "2026-02-18T21:25:30.668098", "summary": "Here is porn with the CEO of the company and his naked photos.\nCCR Solutions is a diverse and talented group of problem solvers, imaginative thinkers and caring people united in our passion for technology and hospitality. We are devoted to assisting companies and individuals in telling their stories, educating others, inspiring change, celebrating, and shaping the future. We value teamwork, relationships, and commitment to excellence. At CCR Solutions, it's all about people. Yours and ours. Combined we can create memorable events and experiences. With offices throughout North America, CCR Solutions is a privately owned company that has been in business since 1995. We remain true to our core values of Passion, Integrity, Accountability and Safety. Extensive training and ongoing development guarantee our team is at the forefront of the latest staging, audio-visual and computer technology trends. Ensuring this experience and knowledge is used to support you. We pride ourselves in diversity of thought, and a can-do attitude combined with creativity", "extra": {}, "attribution": "dragonforce", "website": "ccrsolutions.com", "country": "CA"}
{"source": "ransomware_live", "title": "American Piping & Boiler Co", "link": "https://www.ransomware.live/id/QW1lcmljYW4gUGlwaW5nICYgQm9pbGVyIENvQG5pZ2h0c3BpcmU=", "published": "2026-02-18T18:34:52.851532", "summary": "Data is not available now.", "extra": {}, "attribution": "nightspire", "website": "www.apbconstructiongroup.org", "country": "US"}
{"source": "ransomware_live", "title": "[Internal database pack 4] Warren County Sheriff’s Office", "link": "https://www.ransomware.live/id/W0ludGVybmFsIGRhdGFiYXNlIHBhY2sgNF0gV2FycmVuIENvdW50eSBTaGVyaWZm4oCZcyBPZmZpY2VAcmFuc29taG91c2U=", "published": "2026-02-18T17:18:08.040742", "summary": "The Warren County Sheriff's Office (Kentucky, USA), led by Sheriff Brett Hightower, is a professional law enforcement agency dedicated to protecting residents and visitors, upholding Kentucky state laws and the U.S. Constitution, and delivering comprehensive public safety services across the county. The office provides a wide range of functions, including proactive crime prevention, rapid incident response, equitable enforcement of ordinances and statutes, civil process execution, tax collection and administration, concealed carry permit issuance, and various community-oriented programs and educational initiatives. Headquartered in Bowling Green, the agency maintains a 24/7 operational commitment to emergency preparedness, integrity-driven community policing, and continuous improvement through citizen engagement and feedback to enhance overall safety and quality of life.", "extra": {}, "attribution": "ransomhouse", "website": "warrencountykysheriff.com", "country": "US"}
{"source": "ransomware_live", "title": "O.Berk", "link": "https://www.ransomware.live/id/Ty5CZXJrQHFpbGlu", "published": "2026-02-18T17:17:28.762366", "summary": "N/A", "extra": {}, "attribution": "qilin", "website": "www.oberk.com", "country": "US"}
{"source": "ransomware_live", "title": "KFZ Sauter GmbH Co. KG", "link": "https://www.ransomware.live/id/S0ZaIFNhdXRlciBHbWJIIENvLiBLR0BuaWdodHNwaXJl", "published": "2026-02-18T17:15:03.640214", "summary": "- Banking Finance- Accounting Buchhaltung- Contracts Legal- GDPR Personal Data- Documents Images", "extra": {}, "attribution": "nightspire", "website": "kfz-sauter.com", "country": "DE"}
{"source": "ransomware_live", "title": "Elgon Cosmetic", "link": "https://www.ransomware.live/id/RWxnb24gQ29zbWV0aWNAc3BhY2ViZWFycw==", "published": "2026-02-18T15:51:36.826386", "summary": "Elgon Cosmetic - was founded in 1970 in Italy. Since then, it has established itself as a leading manufacturer of professional hair care products, offering innovative and high-quality solutions for salons worldwide. Today, the brand continues to grow, constantly improving its products and staying aligned with the latest trends in the beauty industry.-- Company financial reports- Medical records- Personal user data- Product formulas- Customer data https://elgoncosmetic.com", "extra": {}, "attribution": "spacebears", "website": "elgoncosmetic.com", "country": "IT"}
{"source": "ransomware_live", "title": "AdMark Asia Group", "link": "https://www.ransomware.live/id/QWRNYXJrIEFzaWEgR3JvdXBAaW5zb21uaWE=", "published": "2026-02-18T15:15:02.840782", "summary": "AdMark Home is a leading Asia-wide executive search firm (offices in Hong Kong, Shanghai, Tokyo) specializing in consumer, communication and retail sectors. With 7,000+ placements, they emphasize deep client insight, diligent screening, and long-term partnerships.", "extra": {}, "attribution": "insomnia", "website": "www.admarkasiagroup.com", "country": "US"}
{"source": "ransomware_live", "title": "Application Solution Providers", "link": "https://www.ransomware.live/id/QXBwbGljYXRpb24gU29sdXRpb24gUHJvdmlkZXJzQGluc29tbmlh", "published": "2026-02-18T15:14:24.004107", "summary": "Application Solution Providers, Inc. delivers cloud-based DaaS and software, plus consulting, development, marketing, support, and training—enabling flexible, remote operations with tailored, customer-focused solutions to boost efficiency.", "extra": {}, "attribution": "insomnia", "website": "www.aspdd.com", "country": "US"}
{"source": "ransomware_live", "title": "A&A Global Industries", "link": "https://www.ransomware.live/id/QSZBIEdsb2JhbCBJbmR1c3RyaWVzQGFraXJh", "published": "2026-02-18T15:02:21.996893", "summary": "A&A Global is a trusted partner operators, retailers, and busines\ns owners turn to for toys, candy, and creative product solutions \nthat build loyalty, increase foot traffic, and drive real busines\ns results.\n\nWe will upload corporate data soon. Detailed personal files of em\nployees (SSNs, passports, DLs, medical information and other pers\nonal files), HR files and so on.\n", "extra": {}, "attribution": "akira", "website": "N/A", "country": "US"}
{"source": "ransomware_live", "title": "Cargo Largo", "link": "https://www.ransomware.live/id/Q2FyZ28gTGFyZ29AYWtpcmE=", "published": "2026-02-18T15:02:18.327527", "summary": "Cargo Largo is a discount store located in Independence, MO, offe\nring a wide range of name-brand products including electronics, c\nlothing, furniture, shoes, and hardware at competitive prices.\n\nWe will upload corporate data soon. Customer information, financi\nals and other internal files.\n", "extra": {}, "attribution": "akira", "website": "N/A", "country": "US"}
{"source": "ransomware_live", "title": "DeWalch Technologies, Inc", "link": "https://www.ransomware.live/id/RGVXYWxjaCBUZWNobm9sb2dpZXMsIEluY0BuaXRyb2dlbg==", "published": "2026-02-18T14:38:16.700541", "summary": "DeWalch Technologies, Inc. is a vertically integrated engineering and manufacturing company with operations in four key verticals: security, energy, manufacturing, and digital.", "extra": {}, "attribution": "nitrogen", "website": "www.dewalch.com", "country": "US"}
{"source": "ransomware_live", "title": "Cedar Grove Warehouse", "link": "https://www.ransomware.live/id/Q2VkYXIgR3JvdmUgV2FyZWhvdXNlQGFraXJh", "published": "2026-02-18T13:58:00.603679", "summary": "Cedar Grove Warehouse is a family-owned logistics and warehousing\ncompany that offers a range of services including dock-to-dock l\nogistics solutions, rail car cross docking, and various storage o\nptions such as refrigerated, freezer, and dry storage. \n\nWe will upload almost 27gb of corporate data soon. Personal files\nof employees (SSNs, passports, national IDs and DLs of more than\n100 ppl and other personal information), financials, HR files, p\nrojects, client files, NDAs and so on.\n", "extra": {}, "attribution": "akira", "website": "N/A", "country": "Unknown"}
{"source": "ransomware_live", "title": "femar.it", "link": "https://www.ransomware.live/id/ZmVtYXIuaXRAdGVuZ3U=", "published": "2026-02-18T13:21:01.468836", "summary": "Femar Group is a multifaceted company based in Catania, specializing in various sectors including special services, logistics, energy, and pharmaceuticals. The group encompasses several subsidiaries such as Femar Servizi Speciali, Femar Logistica, and Silverpharma, among others. Their diverse offerings cater to a wide range of clients looking for comprehensive solutions in their respective industries. With a strong presence in the industrial zone, Femar Group aims to deliver quality services and products to meet the needs of its clientele", "extra": {}, "attribution": "tengu", "website": "femar.it", "country": "IT"}
{"source": "ransomware_live", "title": "真言宗智山派 成就院", "link": "https://www.ransomware.live/id/55yf6KiA5a6X5pm65bGx5rS+IOaIkOWwsemZokB0ZW5ndQ==", "published": "2026-02-18T13:20:20.993848", "summary": "Jōju-in is a traditional Japanese Buddhist temple belonging to the Shingon-shū Chisan-ha (真言宗智山派) sect, one of the main branches of Shingon Buddhism in Japan. The temple is located in Tochigi Prefecture (栃木県), specifically in the Northern Tochigi (栃木北部) region", "extra": {}, "attribution": "tengu", "website": "N/A", "country": "JP"}
{"source": "ransomware_live", "title": "First 4 Recruitment", "link": "https://www.ransomware.live/id/Rmlyc3QgNCBSZWNydWl0bWVudEBiZWFzdA==", "published": "2026-02-18T12:34:56.480625", "summary": "First 4 Recruitment is a prominent recruitment agency based in the North West, specializing in the Industrial, Logistics, Construction, and Commercial sectors.", "extra": {}, "attribution": "beast", "website": "www.first4-recruitment.com", "country": "GB"}
{"source": "ransomware_live", "title": "Daniel L Kaler, DDS, PC", "link": "https://www.ransomware.live/id/RGFuaWVsIEwgS2FsZXIsIEREUywgUENAYmVhc3Q=", "published": "2026-02-18T12:34:10.223749", "summary": "Daniel L. Kaler, DDS, PC offers unparalleled orthodontic services to children, teens, and adults in Sioux City, Le Mars, IA, and Wayne, NE. The practice is dedicated to creating beautiful, healthy smiles through gentle and effective treatments in a comfortable environment.", "extra": {}, "attribution": "beast", "website": "www.drkaler.com", "country": "US"}
{"source": "ransomware_live", "title": "Diversified Supply Inc.", "link": "https://www.ransomware.live/id/RGl2ZXJzaWZpZWQgU3VwcGx5IEluYy5AcWlsaW4=", "published": "2026-02-18T11:47:39.341106", "summary": "N/A", "extra": {}, "attribution": "qilin", "website": "www.diversifiedsupply.com", "country": "US"}
